lkoudelka/STM32WBA-BLE-Privacy/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Privacy_Client/STM32_WPAN/App/app_ble.c
/* Private function prototypes -----------------------------------------------*/
static void BleStack_Process_BG(void);
static void Ble_UserEvtRx(void);
static void BLE_ResumeFlowProcessCallback(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
static void BLE_NvmCallback (SNVMA_Callback_Status_t);
static uint8_t HOST_BLE_Init(void);
/* USER CODE BEGIN PFP */
static uint8_t analyse_adv_report(hci_le_advertising_report_event_rp0 *p_adv_report);
static void Connect_Request(void);
static void stop_scan_timer_cb (void *);
static void stop_scan_timer_task(void);
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  UTIL_SEQ_RegTask(1U << CFG_TASK_BLE_HOST, UTIL_SEQ_RFU, BleStack_Process_BG);
  UTIL_SEQ_RegTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, Ble_UserEvtRx);

  /* NVM emulation in RAM initialization */
  NVM_Init(buffer_nvm, 0, CFG_BLEPLAT_NVM_MAX_SIZE);

  /* First register the APP BLE buffer */
  SNVMA_Register (APP_BLE_NvmBuffer,
                  (uint32_t *)buffer_nvm,
                  (CFG_BLEPLAT_NVM_MAX_SIZE * 2));

  /* Realize a restore */
  SNVMA_Restore (APP_BLE_NvmBuffer);
  /* USER CODE BEGIN APP_BLE_Init_Buffers */

  /* USER CODE END APP_BLE_Init_Buffers */

  /* Check consistency */
  if (NVM_Get (NVM_FIRST, 0xFF, 0, 0, 0) != NVM_EOF)
  {
    NVM_Discard (NVM_ALL);
  }

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /* Initialization of HCI & GATT & GAP layer */
    Ble_Hci_Gap_Gatt_Init();

    /* Initialization of the BLE Services */
    SVCCTL_Init();

    /**
     * Initialize GATT Client Application
     */
    GATT_CLIENT_APP_Init();
  }
  /* USER CODE BEGIN APP_BLE_Init_2 */
  UTIL_SEQ_RegTask( 1u << CFG_TASK_CONN_DEV_ID, UTIL_SEQ_RFU, Connect_Request);
  UTIL_SEQ_RegTask( 1u << CFG_TASK_SCAN_TERMINATE_ID, UTIL_SEQ_RFU, stop_scan_timer_task);
  UTIL_TIMER_Create(&stop_scan_timer, 1000, UTIL_TIMER_ONESHOT, stop_scan_timer_cb, NULL);
  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  tBleStatus ret = BLE_STATUS_ERROR;
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;
  UNUSED(ret);
  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;
      if (p_disconnection_complete_event->Connection_Handle == bleAppContext.BleApplicationContext_legacy.connectionHandle)
      {
        bleAppContext.BleApplicationContext_legacy.connectionHandle = 0;
        bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
        LOG_INFO_APP(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
        LOG_INFO_APP("     - Connection Handle:   0x%02X\n     - Reason:    0x%02X\n",
                    p_disconnection_complete_event->Connection_Handle,
                    p_disconnection_complete_event->Reason);

        /* USER CODE BEGIN EVT_DISCONN_COMPLETE_2 */

        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }
      gap_cmd_resp_release();

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */
      uint8_t Num_of_Addresses;
      Bonded_Device_Entry_t Bonded_Device_Entry[10];
      List_Entry_t List_Entry[10];
      aci_gap_get_bonded_devices( &Num_of_Addresses, Bonded_Device_Entry);
      LOG_INFO_APP("==>> aci_gap_get_bonded_devices : success\n\r");
      LOG_INFO_APP("     - Num of addresses:   0x%x\n", Num_of_Addresses);
      for (uint8_t index = 0; index < Num_of_Addresses; index ++)
      {
        LOG_INFO_APP("     - addresse %d type:    0x%x\n     - addresse %d val:    0x%02x%02x%02x%02x%02x%02x\n\r", index, Bonded_Device_Entry[index].Address_Type, index, 
                                                                                          Bonded_Device_Entry[index].Address[5],
                                                                                          Bonded_Device_Entry[index].Address[4],
                                                                                          Bonded_Device_Entry[index].Address[3],
                                                                                          Bonded_Device_Entry[index].Address[2],
                                                                                          Bonded_Device_Entry[index].Address[1],
                                                                                          Bonded_Device_Entry[index].Address[0]);
      

        List_Entry[index].Address_Type = Bonded_Device_Entry[index].Address_Type;
        List_Entry[index].Address[5] = Bonded_Device_Entry[index].Address[5];
        List_Entry[index].Address[4] = Bonded_Device_Entry[index].Address[4];
        List_Entry[index].Address[3] = Bonded_Device_Entry[index].Address[3];
        List_Entry[index].Address[2] = Bonded_Device_Entry[index].Address[2];
        List_Entry[index].Address[1] = Bonded_Device_Entry[index].Address[1];
        List_Entry[index].Address[0] = Bonded_Device_Entry[index].Address[0];
            
      }
      
      if (Num_of_Addresses > 0)
      {
        ret = aci_gap_add_devices_to_list( Num_of_Addresses, &List_Entry[0], 0x1);
        if (ret != BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("==>> aci_gap_add_devices_to_list : fail : 0x%x\n\r", ret);
        }
        else
        {
          LOG_INFO_APP("==>> aci_gap_add_devices_to_list : success\n\r");
        }
      }
      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_conn_update_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                       conn_interval_us / 1000,
                       (conn_interval_us%1000) / 10,
                       p_conn_update_complete->Conn_Latency,
                       p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(p_conn_update_complete);

