lkoudelka/STM32WBA-BLE-Privacy/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Privacy_Client/STM32_WPAN/App/app_ble.c
static void BleStack_Process_BG(void)
{
  if (BleStack_Process( ) == 0x0)
  {
    BleStackCB_Process( );
  }
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

/**
  * @brief  Notify the LL to resume the flow process
  * @param  None
  * @retval None
  */
static void BLE_ResumeFlowProcessCallback(void)
{
  /* Receive any events from the LL. */
  change_state_options_t notify_options;

  notify_options.combined_value = 0x0F;

  ll_intf_chng_evnt_hndlr_state( notify_options );
}

static void BLE_NvmCallback (SNVMA_Callback_Status_t CbkStatus)
{
  if (CbkStatus != SNVMA_OPERATION_COMPLETE)
  {
    /* Retry the write operation */
    SNVMA_Write (APP_BLE_NvmBuffer,
                 BLE_NvmCallback);
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static uint8_t analyse_adv_report(hci_le_advertising_report_event_rp0 *p_adv_report)
{
  uint8_t adv_type = 0, adv_data_size, found_status, manufBlueST;
  uint8_t *p_adv_data;
  uint16_t i;
  tBleStatus ret;
  uint8_t peer_RPA_adress[6];
  bool known_bd_address = false;

  found_status = 0;
  if ((adv_type = p_adv_report->Advertising_Report[0].Event_Type) != 0x00)
  {
    return 0;
  }
  
  adv_data_size = p_adv_report->Advertising_Report[0].Length_Data;
  
  LOG_INFO_APP("New Adv report -> Even Type : 0x%02x  - Address Type : 0x%02x  - Address : 0x%02X:%02X:%02X:%02X:%02X:%02X  - Length Data  : %d\n\r",
            adv_type,             
            p_adv_report->Advertising_Report[0].Address_Type,
            p_adv_report->Advertising_Report[0].Address[5],
            p_adv_report->Advertising_Report[0].Address[4],
            p_adv_report->Advertising_Report[0].Address[3],
            p_adv_report->Advertising_Report[0].Address[2],
            p_adv_report->Advertising_Report[0].Address[1],
            p_adv_report->Advertising_Report[0].Address[0],
            adv_data_size);
  p_adv_data = (uint8_t*)(&p_adv_report->Advertising_Report[0].Length_Data) + 1;
  
  if (adv_data_size > 0)
    LOG_INFO_APP("    --> adv data :");
  for (i = 0; i < adv_data_size; i++)
  {
    LOG_INFO_APP("%02x", p_adv_data[i]);
  }
  LOG_INFO_APP("\n\r");
  
  if (allow_RPA_resolution == true)
  {
    ret = hci_le_read_peer_resolvable_address( 0x00,
                                              &(p_adv_report->Advertising_Report[0].Address[0]),
                                              &(peer_RPA_adress[0]));
    if (ret == BLE_STATUS_SUCCESS)
    {
      known_bd_address = true;
    }
  }
    
  LOG_INFO_APP("\n\r");
  
  if (adv_type == HCI_ADV_EVT_TYPE_ADV_IND)
  {
    uint8_t ad_length, ad_type;
    p_adv_data = (uint8_t*)(&p_adv_report->Advertising_Report[0].Length_Data) + 1;

    i = 0;
    while(i < adv_data_size)
    {
      ad_length = p_adv_data[i];
      ad_type = p_adv_data[i + 1];

      switch (ad_type)
      {
        case AD_TYPE_FLAGS:
          break;
        case AD_TYPE_TX_POWER_LEVEL:
          break;
        case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
        {
          manufBlueST = UINT8_MAX;
          if ((ad_length >= 7) && 
              ((*(p_adv_data + i + 4)) == 0x02) &&  /* blueST v2*/
              ((*(p_adv_data + i + 6)) == 0x83))    /* p2pServer application */
          {
            /* p2pServer BlueST v2 detected */
            manufBlueST = 0x02;
          }
          else if ((ad_length >= 7) && 
                   ((*(p_adv_data + i + 2)) == 0x01)) /* blueST v1*/
          {
            /* p2pServer BlueST v1 detected */
            manufBlueST = 0x01;
          }
          if(manufBlueST != UINT8_MAX)
          {
            bleAppContext.a_deviceServerAddrType = p_adv_report->Advertising_Report[0].Address_Type;
            bleAppContext.a_deviceServerBdAddr[0] = p_adv_report->Advertising_Report[0].Address[0];
            bleAppContext.a_deviceServerBdAddr[1] = p_adv_report->Advertising_Report[0].Address[1];
            bleAppContext.a_deviceServerBdAddr[2] = p_adv_report->Advertising_Report[0].Address[2];
            bleAppContext.a_deviceServerBdAddr[3] = p_adv_report->Advertising_Report[0].Address[3];
            bleAppContext.a_deviceServerBdAddr[4] = p_adv_report->Advertising_Report[0].Address[4];
            bleAppContext.a_deviceServerBdAddr[5] = p_adv_report->Advertising_Report[0].Address[5];

            bleAppContext.deviceServerFound = 0x1;
            
            LOG_INFO_APP("  P2P server\
                         \n     - Even Type    : 0x%02x\
                         \n     - Address Type : 0x%02x\
                         \n     - bd addr      : 0x%02X:%02X:%02X:%02X:%02X:%02X\
                         \n     - Length Data  : %d\n",
                            p_adv_report->Advertising_Report[0].Event_Type,
                            p_adv_report->Advertising_Report[0].Address_Type,
                            bleAppContext.a_deviceServerBdAddr[5],
                            bleAppContext.a_deviceServerBdAddr[4],
                            bleAppContext.a_deviceServerBdAddr[3],
                            bleAppContext.a_deviceServerBdAddr[2],
                            bleAppContext.a_deviceServerBdAddr[1],
                            bleAppContext.a_deviceServerBdAddr[0],
                            p_adv_report->Advertising_Report[0].Length_Data);
            if (adv_data_size > 0)
              LOG_INFO_APP("     - Adv Data     : ");
            for (uint8_t index = 0; index < adv_data_size; index++)
            {
              LOG_INFO_APP("%02x", p_adv_data[index]);
            }
            if (adv_data_size > 0)
              LOG_INFO_APP("\n\n\r");

            if (allow_connection == true)
            {
              found_status = 1;
            }
            
            if (known_bd_address == true)
            {
              LOG_INFO_APP("Address RPA  : 0x%02X:%02X:%02X:%02X:%02X:%02X\n\r",
                  peer_RPA_adress[5],
                  peer_RPA_adress[4],
                  peer_RPA_adress[3],
                  peer_RPA_adress[2],
                  peer_RPA_adress[1],
                  peer_RPA_adress[0]);    
              LOG_INFO_APP("    --> device already bonded\n\n");
              found_status = 0x0;
            } 
          }
          break;
        }
        default:
          break;
        }/* end of switch*/

      i += ad_length + 1; /* increment the iterator to go on next element*/
      /*
      if (found_status != 0)
      {
        break;
      }
      */
    }/* end of while*/
  }
  
  return found_status;
}

static void Connect_Request(void)
{
  tBleStatus result;

  LOG_INFO_APP("Create connection to P2Pserver\n");

  result = aci_gap_create_connection(SCAN_INT_MS(500u), SCAN_WIN_MS(500u),
                                     bleAppContext.a_deviceServerAddrType,
                                     &bleAppContext.a_deviceServerBdAddr[0],
                                     GAP_RESOLVABLE_PRIVATE_ADDR,
                                     CONN_INT_MS(50u), CONN_INT_MS(100u),
                                     0u,
                                     CONN_SUP_TIMEOUT_MS(5000u),
                                     CONN_CE_LENGTH_MS(10u), CONN_CE_LENGTH_MS(10u));
  if (result == BLE_STATUS_SUCCESS)
  {
    bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
    LOG_INFO_APP("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
    UTIL_SEQ_WaitEvt(1u << CFG_IDLEEVT_CONNECTION_COMPLETE);
    if(new_ConnHdl != 0u)
    {
      GATT_CLIENT_APP_Set_Conn_Handle(0, new_ConnHdl);
      new_ConnHdl = 0u;
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, GPIO_PIN_RESET); 
    }
  }
  else
  {
    LOG_INFO_APP("==>> GAP Create connection Failed , result: 0x%02x\n", result);
  }
  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

