lkoudelka/STM32WBA-BLE-Privacy/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Privacy_Client/STM32_WPAN/App/app_ble.c
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      memcpy( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

void NVMCB_Store( const uint32_t* ptr, uint32_t size )
{
  UNUSED(ptr);
  UNUSED(size);

  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  allow_connection = APPE_ButtonIsLongPressed(B1);
  APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
  return;
}


void APPE_Button2Action(void)
{
  tBleStatus ret;
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Fail, result: 0x%02X \n", ret);
    }
    else
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Success\n");
    }
    ret = aci_gap_add_devices_to_list(0, NULL, 0x01);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("==>> clear resolving list - Fail, result: 0x%02X \n", ret);
    }
    else
    {
      LOG_INFO_APP("==>> clear resolving list - Success\n");
    }    
  }
  else
  {
  }
  return;
}

void APPE_Button3Action(void)
{
  allow_RPA_resolution = !allow_RPA_resolution;
  tBleStatus ret = hci_le_set_address_resolution_enable(allow_RPA_resolution);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> hci_le_set_address_resolution_enable - Fail, result: 0x%02X \n", ret);
    LOG_INFO_APP("==>> This command can't be used when advertising or scanning is enabled and when Create connection command is outstanding\n");
  }
  else
  {
    if (allow_RPA_resolution == true)
    {
      LOG_INFO_APP("==>> Successfully enabled hci_le_set_address_resolution_enable \n");
    }
    else
    {
      LOG_INFO_APP("==>> Successfully disabled hci_le_set_address_resolution_enable \n");
    }
  }
  return;
}
#endif

void stop_scan_timer_cb(void * arg)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_SCAN_TERMINATE_ID, CFG_SEQ_PRIO_0);
  return;
}
                  
static void stop_scan_timer_task(void)
{
  APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_TERMINATE);
  return;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
